Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСРегламентнымиЗаданиями/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Создает задачу из серии ОшибкиРегламентыхЗаданий в текущую дату сеанса
//
// Параметры:
//     ТекстЗадачи         - Строка,Массив - массив из строк, преобразуется в многострочный текст
//     Источник            - Строка - описание механизма, при исполении которого возникла ошибка
//                         - СправочникСсылка.ДополнительныеОтчетыИОбработки - устаревший вариант. Будет преобразован к виду, аналогичному вызову Метаданные().ПолноеИмя() 
//     ГруппаПользователей - СправочникСсылка.ГруппыПользователей - если не задан, выбирается группа ВсеПользователи
//     СессияСтатистики    - УникальныйИдентификатор - Иднетификатор сессии статистики
//
// Примечание:
//     Перед регистрацией новой ошибки проверяется наличие не выполненной и аналогичной по тексту и источнику за текущую дату сеанса
//
Функция ЗарегистрироватьОшибку(Знач ТекстЗадачи, Знач Источник, ГруппаПользователей = Неопределено, СессияСтатистики = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаЗадачи = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ТекстЗадачи) = Тип("Массив") Тогда
		ТекстЗадачи = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ТекстЗадачи, Символы.ПС);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Вид, ИмяОбъекта");
		
		Если РеквизитыИсточника.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			Источник = "ВнешниеОтчеты";
		Иначе
			Источник = "ВнешниеОбработки";
		КонецЕсли;
		
		Источник = Источник + "." + РеквизитыИсточника.ИмяОбъекта;
		
	КонецЕсли;
	
	// Ограничения релиза 8.3.7 - нельзя пихать в ПОДОБНО строку длиной больше 1024 символа.
	// Таким образом максимальная длина текста задачи стала 1000 символов
	
	МаксимальныйРазмерИскомогоТекста = 1000;
	
	ИскомыйТекст = ТекстЗадачи;
	Если СтрДлина(ИскомыйТекст) > МаксимальныйРазмерИскомогоТекста Тогда
		ИскомыйТекст = Лев(ИскомыйТекст, МаксимальныйРазмерИскомогоТекста);
	КонецЕсли;
	
	// Сначала проверим, а не было ли у нас уже аналогичной задачи
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОшибкиРегламентыхЗаданий.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ОшибкиРегламентыхЗаданий КАК ОшибкиРегламентыхЗаданий
		|ГДЕ
		|	ОшибкиРегламентыхЗаданий.Источник = &Источник
		|	И НЕ ОшибкиРегламентыхЗаданий.Выполнена
		|	И ОшибкиРегламентыхЗаданий.Дата МЕЖДУ &ДатаЗадачиНачалоДня И &ДатаЗадачиКонецДня
		|	И (ВЫРАЗИТЬ(ОшибкиРегламентыхЗаданий.ТекстЗадачи КАК СТРОКА(1))) = &ТекстЗадачи");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СТРОКА(1)", Формат(МаксимальныйРазмерИскомогоТекста, "ЧФ=СТРОКА(Ч); ЧГ="));
	
	Запрос.УстановитьПараметр("ТекстЗадачи",         ИскомыйТекст);
	Запрос.УстановитьПараметр("Источник",            Источник);
	Запрос.УстановитьПараметр("ДатаЗадачиНачалоДня", НачалоДня(ДатаЗадачи));
	Запрос.УстановитьПараметр("ДатаЗадачиКонецДня",  КонецДня(ДатаЗадачи));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// если не было, создадим
	НоваяЗадача = Задачи.ОшибкиРегламентыхЗаданий.СоздатьЗадачу();
	НоваяЗадача.Дата                = ДатаЗадачи;
	НоваяЗадача.ГруппаПользователей = ?(ГруппаПользователей = Неопределено, Справочники.ГруппыПользователей.ВсеПользователи, ГруппаПользователей);
	НоваяЗадача.ТекстЗадачи         = ТекстЗадачи;
	НоваяЗадача.Источник            = Источник;
	НоваяЗадача.Наименование        = Источник;
	НоваяЗадача.СессияСтатистики	= СессияСтатистики;
	НоваяЗадача.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НоваяЗадача.Ссылка;
	
КонецФункции // ЗарегистрироватьОшибку

////////////////////////////////////////////////////////////////////////////////
// РЕГЛАМЕНТНЫЕ ЗАДАНИЯ

// Возвращает использование регламентного задания.
//  Перед вызовом требуется иметь право Администрирования
// или УстановитьПривилегированныйРежим.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание.
//
// Возвращаемое значение:
//  Булево.
// 
Функция ПолучитьИспользованиеРегламентногоЗадания(Знач Идентификатор) Экспорт
	
	РаботаСРегламентнымиЗаданиямиСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Возврат Задание.Использование;
	
КонецФункции

// Устанавливает использование регламентного задания.
//  Перед вызовом требуется иметь право Администрирования
// или УстановитьПривилегированныйРежим.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание.
//
// Использование  - Булево.
// 
Процедура УстановитьИспользованиеРегламентногоЗадания(Знач Идентификатор, Знач Использование) Экспорт
	
	РаботаСРегламентнымиЗаданиямиСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если Задание.Использование <> Использование Тогда
		Задание.Использование = Использование;
	КонецЕсли;
	
	Задание.Записать();
	
КонецПроцедуры

// Возвращает расписание регламентного задания.
//  Перед вызовом требуется иметь право Администрирования
// или УстановитьПривилегированныйРежим.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание.
//
// ВСтруктуре     - Булево, если Истина, тогда расписание будет преобразовано
//                  в структуру, которую можно передать на клиент.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПолучитьРасписаниеРегламентногоЗадания(Знач Идентификатор, Знач ВСтруктуре = Ложь) Экспорт
	
	РаботаСРегламентнымиЗаданиямиСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если ВСтруктуре Тогда
		Возврат РасписаниеВСтруктуру(Задание.Расписание);
	КонецЕсли;
	
	Возврат Задание.Расписание;
	
КонецФункции

// Устанавливает расписание регламентного задания.
//  Перед вызовом требуется иметь право Администрирования
// или УстановитьПривилегированныйРежим.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание.
//
// Расписание     - РасписаниеРегламентногоЗадания.
//                - Структура расписания, как возвращает функция
//                  ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру.
// 
Процедура УстановитьРасписаниеРегламентногоЗадания(Знач Идентификатор, Знач Расписание) Экспорт
	
	РаботаСРегламентнымиЗаданиямиСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Задание.Расписание = Расписание;
	Иначе
		Задание.Расписание = СтруктураВРасписание(Расписание);
	КонецЕсли;
	
	Задание.Записать();
	
КонецПроцедуры

// Возвращает РегламентноеЗадание из информационной базы.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание из которого нужно получить уникальный
//                  идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание, прочитанное из базы данных.
//
Функция ПолучитьРегламентноеЗадание(Знач Идентификатор) Экспорт
	
	РаботаСРегламентнымиЗаданиямиСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		ВызватьИсключение( НСтр("ru = 'Регламентное задание не найдено.
		                              |Возможно, оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОТЛОЖЕННЫЕ ЗАДАНИЯ

// Функция - Добавить отложенное задание
//
// Параметры:
//  Объект							 - Строка|СправочникСсылка.ДополнительныеОтчетыИОбработки - Полное имя объекта метаданных или ссылка на объект отчета/обработки, метод которой необходимо выполнить
//  Команда							 - Строка - Имя выполняемого метода
//  Параметры						 - Структура - Параметры, передаваемые в вызываемый метод
//  Таймаут							 - Число - Интервал времени в минутах, по истечении которого в регистре отложенных заданий будет зафиксирована ошибка выполнения отложенного задания
//  ПерезапускатьПоИстечениюТаймаута - Булево - Признак необходимости добавления новой записи для выполнения задания с теми же параметрами
//  ДатаЗапускаПлан					 - ДатаВремя - Дата и время, ранее которых задание запусаться не будет
// 
// Возвращаемое значение:
//  Идентификатор задания или Неопределено
//
Функция ДобавитьОтложенноеЗадание(Объект, Команда, Параметры, Таймаут = 0, ПерезапускатьПоИстечениюТаймаута = Ложь, ДатаЗапускаПлан = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПредставлениеОбъекта = "";
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ПредставлениеОбъекта = Объект;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		ПредставлениеОбъекта = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(Объект.Вид) + "." + Объект.ИмяОбъекта;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ОтложенныеЗадания.СоздатьМенеджерЗаписи();
	
	Запись.Объект							= Объект;
	Запись.Идентификатор					= Новый УникальныйИдентификатор();
	Запись.Команда							= Команда;
	Запись.Таймаут							= Таймаут;
	Запись.ПерезапускатьПоИстечениюТаймаута	= ПерезапускатьПоИстечениюТаймаута;
	Запись.Состояние						= Перечисления.СостоянияОтложенныхЗаданий.Ожидание;
	Запись.ДатаДобавления					= ТекущаяДатаСеанса();
	Запись.ДатаЗапускаПлан					= ?(ДатаЗапускаПлан = Неопределено, Запись.ДатаДобавления, ДатаЗапускаПлан);
	
	Параметры.Свойство("Организация", Запись.Организация);
	
	ОписаниеПараметров = "";		
	
	Если Параметры <> Неопределено И Параметры.Количество() > 0 Тогда
		
		Запись.Параметры = Новый ХранилищеЗначения(Параметры);
		
		Для Каждого ТекПараметр Из Параметры Цикл
			Если ТекПараметр.Ключ <> "ТекстОшибки" И ТекПараметр.Ключ <> "ИсточникОшибки" Тогда
				ОписаниеПараметров = ?(ОписаниеПараметров <> "", ОписаниеПараметров + Символы.ПС, "") + ТекПараметр.Ключ + " = " + Строка(ТекПараметр.Значение);	
			КонецЕсли;
			
		КонецЦикла;
		
		Запись.ОписаниеПараметров = ОписаниеПараметров;
		
		Если Объект = "Обработки.ФормированиеБухгалтерскогоУчета" Тогда
		
			Запись.Организация					= Параметры.Организация;
			Запись.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
			Запись.ВидУчета						= Параметры.ВидУчета;
			Запись.Сложность					= Параметры.Сложность;
			Запись.Пользователь					= Параметры.Пользователь;
			Запись.ИнтерактивныйЗапуск			= Истина;
		
		КонецЕсли;
		
	КонецЕсли;
		
	Попытка
		
		Запись.Записать();
		Результат = Запись.Идентификатор;
		
	Исключение
		
		Результат = Неопределено;
		
		ТекстОшибки = СтрШаблон("Не удалось добавить отложенное задание, объект: %1, команда: %2", ПредставлениеОбъекта, Команда);
		Если Параметры.Свойство("ТекстОшибки") Тогда
			ТекстОшибки = Параметры.ТекстОшибки;
		КонецЕсли;
		
		Если Параметры.Свойство("ИсточникОшибки") Тогда
			ИсточникОшибки = Параметры.ИсточникОшибки;
		КонецЕсли;
		
		Для каждого ТекПараметр Из Параметры Цикл
			Если ТекПараметр.Ключ <> "ТекстОшибки" И ТекПараметр.Ключ <> "ИсточникОшибки" Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + ТекПараметр.Ключ + ": " + ТекПараметр.Значение;
			КонецЕсли;
		КонецЦикла;
		
		ЗарегистрироватьОшибку(ТекстОшибки, ИсточникОшибки);
		
	КонецПопытки;
			
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат Результат;
	
КонецФункции

// Функция - Зафиксировать запуск отложенного задания
//
// Параметры:
//  Идентификатор	 - УникальныйИдентификатор - идентификатор задания
// 
// Возвращаемое значение:
//  Булево - Признак успешной смены состояния выполнения задания
//
Функция ЗафиксироватьЗапускОтложенногоЗадания(Идентификатор, ИдентификаторФоновогоЗадания = Неопределено) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	Записи.Отбор.Идентификатор.Установить(Идентификатор);
	Записи.Отбор.Организация.Установить(ПолучитьОрганизациюОтложенногоЗадания(Идентификатор));
	Записи.Прочитать();
	
	Попытка
		
		Запись = Записи[0];
		
		Если Запись.ИнтерактивныйЗапуск И Запись.Состояние <> Перечисления.СостоянияОтложенныхЗаданий.Ожидание Тогда 
			Результат = Ложь;
		Иначе
			Запись.Состояние	= Перечисления.СостоянияОтложенныхЗаданий.Выполняется;
			Запись.ДатаЗапуска	= ТекущаяДатаСеанса();
			
			Если ИдентификаторФоновогоЗадания <> Неопределено Тогда
				Запись.ИдентификаторФоновогоЗадания = ИдентификаторФоновогоЗадания;
			КонецЕсли;
			
			Записи.Записать();
		КонецЕсли;
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ОтменитьОтложенноеЗадание(Идентификатор, Комментарий = "", Пересоздать = Ложь) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	Записи.Отбор.Идентификатор.Установить(Идентификатор);
	Записи.Отбор.Организация.Установить(ПолучитьОрганизациюОтложенногоЗадания(Идентификатор));
	Записи.Прочитать();
	
	Задание = Записи[0];
	
	Если Пересоздать Тогда
		ДобавитьОтложенноеЗадание(Задание.Объект, Задание.Команда, Задание.Параметры.Получить());
	КонецЕсли;
	
	Задание.Состояние			= Перечисления.СостоянияОтложенныхЗаданий.Отменено;
	Задание.Комментарий			= Комментарий;
	Задание.ДатаОшибкиОтмены	= ТекущаяДатаСеанса();
	
	Записи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьПовторноОтложенноеЗадание(Идентификатор) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	Записи.Отбор.Идентификатор.Установить(Идентификатор);
	Записи.Прочитать();
	
	Задание = Записи[0];
	
	ДобавитьОтложенноеЗадание(Задание.Объект, Задание.Команда, Задание.Параметры.Получить());
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ЗафиксироватьВыполнениеОтложенногоЗадания(Идентификатор, ЗавершилосьОшибкой = Ложь, Комментарий = "") Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	Записи.Отбор.Идентификатор.Установить(Идентификатор);
	Записи.Отбор.Организация.Установить(ПолучитьОрганизациюОтложенногоЗадания(Идентификатор));
	Записи.Прочитать();
	
	Запись = Записи[0];
	
	Если ЗавершилосьОшибкой Тогда
		Запись.Состояние	= Перечисления.СостоянияОтложенныхЗаданий.Ошибка;
		Запись.Комментарий	= Комментарий + ?(ПустаяСтрока(Комментарий), "", Символы.ПС);
		
		СообщенияФоновогоЗадания = РаботаСДлительнымиОперациями.ПолучитьСообщения(Запись.ИдентификаторФоновогоЗадания);
		Если СообщенияФоновогоЗадания.Количество() = 0 Тогда
			Запись.Комментарий = Запись.Комментарий + "Сообщения не зафиксированы";
		Иначе
		    Запись.Комментарий = Запись.Комментарий + "Зафиксированы сообщения:" + Символы.ПС + СтрСоединить(СообщенияФоновогоЗадания, Символы.ПС);
		КонецЕсли;
	Иначе
		Запись.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Завершено;
	КонецЕсли;
	
	Запись.ДатаВыполнения = ТекущаяДатаСеанса();
	
	Записи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьИдентификаторыФоновогоЗадания(Экземпляры)

	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Если ТипЗнч(ФоновоеЗадание) = Тип("ФоновоеЗадание") Тогда
		
		ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
		
		Организация = ПолучитьОрганизациюОтложенногоЗадания(Экземпляры[0].Идентификатор); 
		
		// заблокируем наши задания
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтложенныеЗадания");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		ЭлементБлокировки.ИсточникДанных = Экземпляры;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		Для каждого Экземпляр Из Экземпляры Цикл
			
			Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
			Записи.Отбор.Идентификатор.Установить(Экземпляр.Идентификатор);
		    Записи.Отбор.Организация.Установить(Организация);
			Записи.Прочитать();
			
			Запись = Записи[0];
			
			Если Запись.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Отменено Тогда // успели уже отменить, ничего запускать не надо
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			
			Запись.ИдентификаторФоновогоЗадания = ИдентификаторФоновогоЗадания;
			
			Записи.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию(); 
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЗапуститьОтложенноеЗадание(Объект, Команда, Экземпляры) Экспорт
	
	Если НЕ УстановитьИдентификаторыФоновогоЗадания(Экземпляры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Обработка / отчет из дерева конфигурации.
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		
		// Отчет.
		Если ВРег(Лев(Объект, 7)) = "ОТЧЕТЫ." Тогда
			КоллекцияМетаданных = Отчеты;
		// Обработка.
		ИначеЕсли ВРег(Лев(Объект, 10)) = "ОБРАБОТКИ." Тогда
			КоллекцияМетаданных = Обработки;
		Иначе 
			Модуль = СистемныеФункции.СерверныйМодульМенеджера(Объект);
			Модуль.ВыполнитьМетод(Команда, Экземпляры);
			Возврат Результат;
		КонецЕсли;
		
		ИмяОбъекта = Сред(Объект, Найти(Объект, ".") + 1);
		
		ОбъектОбработкаОтчет = КоллекцияМетаданных[ИмяОбъекта].Создать();
		
	// Дополнительный отчет / обработка.
	Иначе
		ОбъектОбработкаОтчет = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки(Объект);
	КонецЕсли;
	
	ОбъектОбработкаОтчет.ВыполнитьМетод(Команда, Экземпляры);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция УдалитьДанныеОЗадании(Идентификатор) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записи = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	Записи.Отбор.Идентификатор.Установить(Идентификатор);
	Записи.Прочитать();
	
	Записи.Очистить();
	
	Попытка
		
		Записи.Записать(Истина);
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить информацию об отложенном заданияи с идентификатором '" + Строка(Идентификатор) + "'!" + Символы.ПС + ОписаниеОшибки());
		
		Результат = Ложь;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

// Преобразует РасписаниеРегламентногоЗадания в структуру.
//
// Параметры:
//  Расписание - РасписаниеРегламентногоЗадания;
// 
// Возвращаемое значение:
//  Структура.
//
Функция РасписаниеВСтруктуру(Знач Расписание)
	
	ЗначениеРасписания = Расписание;
	Если ЗначениеРасписания = Неопределено Тогда
		ЗначениеРасписания = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	
	СписокПолей = "ВремяЗавершения,ВремяКонца,ВремяНачала,ДатаКонца,ДатаНачала,ДеньВМесяце,ДеньНеделиВМесяце," + 
		"ДниНедели,ИнтервалЗавершения,Месяцы,ПаузаПовтора,ПериодНедель,ПериодПовтораВТечениеДня,ПериодПовтораДней";
		
	Результат = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(Результат, ЗначениеРасписания, СписокПолей);
	
	ДетальныеРасписанияДня = Новый Массив;
	Для каждого РасписаниеДля Из Расписание.ДетальныеРасписанияДня Цикл
		ДетальныеРасписанияДня.Добавить(РасписаниеВСтруктуру(РасписаниеДля));
	КонецЦикла;
	
	Результат.Вставить("ДетальныеРасписанияДня", ДетальныеРасписанияДня);
	
	Возврат Результат;
	
КонецФункции		

// Преобразует структуру в РасписаниеРегламентногоЗадания.
//
// Параметры:
//  СтруктураРасписания - Структура;
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания.
//
Функция СтруктураВРасписание(Знач СтруктураРасписания)
	
	Если СтруктураРасписания = Неопределено Тогда
		Возврат Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	
	СписокПолей = "ВремяЗавершения,ВремяКонца,ВремяНачала,ДатаКонца,ДатаНачала,ДеньВМесяце,ДеньНеделиВМесяце,"
		+ "ДниНедели,ИнтервалЗавершения,Месяцы,ПаузаПовтора,ПериодНедель,ПериодПовтораВТечениеДня,ПериодПовтораДней";
		
	Результат = Новый РасписаниеРегламентногоЗадания;
	ЗаполнитьЗначенияСвойств(Результат, СтруктураРасписания, СписокПолей);
	
	ДетальныеРасписанияДня = Новый Массив;
	Для каждого Расписание Из СтруктураРасписания.ДетальныеРасписанияДня Цикл
		  ДетальныеРасписанияДня.Добавить(СтруктураВРасписание(Расписание));
	КонецЦикла;
	
	Результат.ДетальныеРасписанияДня = ДетальныеРасписанияДня;  
	
	Возврат Результат;
	
КонецФункции		

Функция ПолучитьОрганизациюОтложенногоЗадания(Идентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтложенныеЗадания.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Организация;
	КонецЕсли;

	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции
